
print("就讀學校:")
print("年級:")
print("姓名:")

v0=5.8 #起始速度
v1=51.6 #結束速度
t = 10 #時間
a = ((v1-v0)/t) #計算公式
print(a)

A = 384400 #距離
B = 400    #加速度
print(A/B)

a = money = 50000 #本金
b = yeat = 5      #年數
c = rate = 0.15   #年利率
print((a*(1+c))*b)

PI = 4 * (1-(1/3)+(1/5)-(1/7)+(1/9)-(1/11)) #圓周率
print(PI)

PI = 4 * (1-(1/3)+(1/5)-(1/7)+(1/9)) #級數執行結果
print(PI)
PI = 4 * (1-(1/3)+(1/5)-(1/7)+(1/9)-(1/11))
print(PI)
PI = 4 * (1-(1/3)+(1/5)-(1/7)+(1/9)-(1/11)+(1/13))
print(PI)

PI = 4 * (1-(1/3)+(1/5)-(1/7)+(1/9)-(1/11)) #圓周率
r = 5
print(PI*r*r) #圓面積
print(2*PI*r) #圓周長

PI = 3+(4/(2*3*4)-4/(4*5*6)+4/(6*7*8)) #尼拉卡莎級數
print(PI)

PI = 3+(4/(2*3*4)-4/(4*5*6)+4/(6*7*8)) #各級數執行結果
print(PI)
PI = 3+(4/(2*3*4)-4/(4*5*6)+4/(6*7*8)-4/(8*9*10)) #各級數執行結果
print(PI)

PI = 3+(4/(2*3*4)-4/(4*5*6)+4/(6*7*8)) #(i)圓柱體面積
r = 20
h = 30
print((r*r*PI)*h)

PI = 3+(4/(2*3*4)-4/(4*5*6)+4/(6*7*8)-4/(8*9*10)) #(ii)圓柱體面積
r = 20
h = 30
print((r*r*PI)*h)